Maxjta/hal_at32/include/dt-bindings/pinctrl/at32f423v(c)xx-pinctrl.h
/*
 * Autogenerated file
 *
 * SPDX-License-Identifier: Apache 2.0
 */

#include "at32_iomux.h"

/* ADC1_IN0 */
#define ADC1_IN0_PA0 \
	AT32_PIN_MUX('A', 0, ANALOG)

/* ADC1_IN1 */
#define ADC1_IN1_PA1 \
	AT32_PIN_MUX('A', 1, ANALOG)

/* ADC1_IN2 */
#define ADC1_IN2_PA2 \
	AT32_PIN_MUX('A', 2, ANALOG)

/* ADC1_IN3 */
#define ADC1_IN3_PA3 \
	AT32_PIN_MUX('A', 3, ANALOG)

/* ADC1_IN4 */
#define ADC1_IN4_PA4 \
	AT32_PIN_MUX('A', 4, ANALOG)

/* ADC1_IN5 */
#define ADC1_IN5_PA5 \
	AT32_PIN_MUX('A', 5, ANALOG)

/* ADC1_IN6 */
#define ADC1_IN6_PA6 \
	AT32_PIN_MUX('A', 6, ANALOG)

/* ADC1_IN7 */
#define ADC1_IN7_PA7 \
	AT32_PIN_MUX('A', 7, ANALOG)

/* ADC12_IN8 */
#define ADC1_IN8_PB0 \
	AT32_PIN_MUX('B', 0, ANALOG)

/* ADC1_IN9 */
#define ADC1_IN9_PB1 \
	AT32_PIN_MUX('B', 1, ANALOG)
	
/* ADC1_IN10 */
#define ADC1_IN10_PC0 \
	AT32_PIN_MUX('C', 0, ANALOG)
	
/* ADC1_IN11 */
#define ADC1_IN11_PC1 \
	AT32_PIN_MUX('C', 1, ANALOG)

/* ADC1_IN12 */
#define ADC1_IN12_PC2 \
	AT32_PIN_MUX('C', 2, ANALOG)

/* ADC1_IN13 */
#define ADC1_IN13_PC3 \
	AT32_PIN_MUX('C', 3, ANALOG)

/* ADC1_IN14 */
#define ADC1_IN14_PC4 \
	AT32_PIN_MUX('C', 4, ANALOG)

/* ADC1_IN15 */
#define ADC1_IN15_PC5 \
	AT32_PIN_MUX('C', 5, ANALOG)

/* ANALOG */
#define ANALOG_PA0 \
	AT32_PIN_MUX('A', 0, ANALOG)
#define ANALOG_PA1 \
	AT32_PIN_MUX('A', 1, ANALOG)
#define ANALOG_PA10 \
	AT32_PIN_MUX('A', 10, ANALOG)
#define ANALOG_PA11 \
	AT32_PIN_MUX('A', 11, ANALOG)
#define ANALOG_PA12 \
	AT32_PIN_MUX('A', 12, ANALOG)
#define ANALOG_PA13 \
	AT32_PIN_MUX('A', 13, ANALOG)
#define ANALOG_PA14 \
	AT32_PIN_MUX('A', 14, ANALOG)
#define ANALOG_PA15 \
	AT32_PIN_MUX('A', 15, ANALOG)
#define ANALOG_PA2 \
	AT32_PIN_MUX('A', 2, ANALOG)
#define ANALOG_PA3 \
	AT32_PIN_MUX('A', 3, ANALOG)
#define ANALOG_PA4 \
	AT32_PIN_MUX('A', 4, ANALOG)
#define ANALOG_PA5 \
	AT32_PIN_MUX('A', 5, ANALOG)
#define ANALOG_PA6 \
	AT32_PIN_MUX('A', 6, ANALOG)
#define ANALOG_PA7 \
	AT32_PIN_MUX('A', 7, ANALOG)
#define ANALOG_PA8 \
	AT32_PIN_MUX('A', 8, ANALOG)
#define ANALOG_PA9 \
	AT32_PIN_MUX('A', 9, ANALOG)
#define ANALOG_PB0 \
	AT32_PIN_MUX('B', 0, ANALOG)
#define ANALOG_PB1 \
	AT32_PIN_MUX('B', 1, ANALOG)
#define ANALOG_PB10 \
	AT32_PIN_MUX('B', 10, ANALOG)
#define ANALOG_PB11 \
	AT32_PIN_MUX('B', 11, ANALOG)
#define ANALOG_PB12 \
	AT32_PIN_MUX('B', 12, ANALOG)
#define ANALOG_PB13 \
	AT32_PIN_MUX('B', 13, ANALOG)
#define ANALOG_PB14 \
	AT32_PIN_MUX('B', 14, ANALOG)
#define ANALOG_PB15 \
	AT32_PIN_MUX('B', 15, ANALOG)
#define ANALOG_PB2 \
	AT32_PIN_MUX('B', 2, ANALOG)
#define ANALOG_PB3 \
	AT32_PIN_MUX('B', 3, ANALOG)
#define ANALOG_PB4 \
	AT32_PIN_MUX('B', 4, ANALOG)
#define ANALOG_PB5 \
	AT32_PIN_MUX('B', 5, ANALOG)
#define ANALOG_PB6 \
	AT32_PIN_MUX('B', 6, ANALOG)
#define ANALOG_PB7 \
	AT32_PIN_MUX('B', 7, ANALOG)
#define ANALOG_PB8 \
	AT32_PIN_MUX('B', 8, ANALOG)
#define ANALOG_PB9 \
	AT32_PIN_MUX('B', 9, ANALOG)	
#define ANALOG_PC0 \
	AT32_PIN_MUX('C', 0, ANALOG)
#define ANALOG_PC1 \
	AT32_PIN_MUX('C', 1, ANALOG)
#define ANALOG_PC10 \
	AT32_PIN_MUX('C', 10, ANALOG)
#define ANALOG_PC11 \
	AT32_PIN_MUX('C', 11, ANALOG)
#define ANALOG_PC12 \
	AT32_PIN_MUX('C', 12, ANALOG)
#define ANALOG_PC13 \
	AT32_PIN_MUX('C', 13, ANALOG)
#define ANALOG_PC14 \
	AT32_PIN_MUX('C', 14, ANALOG)
#define ANALOG_PC15 \
	AT32_PIN_MUX('C', 15, ANALOG)
#define ANALOG_PC2 \
	AT32_PIN_MUX('C', 2, ANALOG)
#define ANALOG_PC3 \
	AT32_PIN_MUX('C', 3, ANALOG)
#define ANALOG_PC4 \
	AT32_PIN_MUX('C', 4, ANALOG)
#define ANALOG_PC5 \
	AT32_PIN_MUX('C', 5, ANALOG)
#define ANALOG_PC6 \
	AT32_PIN_MUX('C', 6, ANALOG)
#define ANALOG_PC7 \
	AT32_PIN_MUX('C', 7, ANALOG)
#define ANALOG_PC8 \
	AT32_PIN_MUX('C', 8, ANALOG)
#define ANALOG_PC9 \
	AT32_PIN_MUX('C', 9, ANALOG)
#define ANALOG_PF0 \
	AT32_PIN_MUX('F', 0, ANALOG)
#define ANALOG_PF1 \
	AT32_PIN_MUX('F', 1, ANALOG)
#define ANALOG_PF11 \
	AT32_PIN_MUX('F', 11, ANALOG)
#define ANALOG_PF4 \
	AT32_PIN_MUX('F', 4, ANALOG)
#define ANALOG_PF5 \
	AT32_PIN_MUX('F', 5, ANALOG)
#define ANALOG_PF6 \
	AT32_PIN_MUX('F', 6, ANALOG)
#define ANALOG_PF7 \
	AT32_PIN_MUX('F', 7, ANALOG)


/* CAN1_RX */
#define CAN1_RX_PA11 \
	AT32_PIN_MUX('A', 11, MUX_9)
#define CAN1_RX_PB8 \
	AT32_PIN_MUX('B', 8, MUX_9)
#define CAN1_RX_PD0 \
	AT32_PIN_MUX('D', 0, MUX_9)

/* CAN1_TX */
#define CAN1_TX_PA12 \
	AT32_PIN_MUX('A', 12, MUX_9)
#define CAN1_TX_PB9 \
	AT32_PIN_MUX('B', 9, MUX_9)
#define CAN1_TX_PD1 \
	AT32_PIN_MUX('D', 1, MUX_9)


/* CAN2_RX */
#define CAN2_RX_PA2 \
	AT32_PIN_MUX('A', 2, MUX_9)
#define CAN2_RX_PB12 \
	AT32_PIN_MUX('B', 12, MUX_9)
#define CAN2_RX_PB5 \
	AT32_PIN_MUX('B', 5, MUX_9)

/* CAN2_TX */
#define CAN2_TX_PA3 \
	AT32_PIN_MUX('A', 3, MUX_9)
#define CAN2_TX_PB13 \
	AT32_PIN_MUX('B', 13, MUX_9)
#define CAN2_TX_PB6 \
	AT32_PIN_MUX('B', 6, MUX_9)

/* CLKOUT1 */
#define CLKOUT1_PA8 \
	AT32_PIN_MUX('A', 8, MUX_0)
#define CLKOUT1_PA9 \
	AT32_PIN_MUX('A', 9, MUX_0)
#define CLKOUT1_PC9 \
	AT32_PIN_MUX('C', 9, MUX_0)
#define CLKOUT1_PB13 \
	AT32_PIN_MUX('B', 13, MUX_0)

/* ERTC_REFIN */
#define ERTC_REFIN_PB15 \
	AT32_PIN_MUX('B', 15, MUX_0)
#define ERTC_REFIN_PA10 \
	AT32_PIN_MUX('A', 10, MUX_0)

/* EVENTOUT */
#define EVENTOUT_PA0 \
	AT32_PIN_MUX('A', 0, MUX_15)
#define EVENTOUT_PA1 \
	AT32_PIN_MUX('A', 1, MUX_15)
#define EVENTOUT_PA10 \
	AT32_PIN_MUX('A', 10, MUX_15)
#define EVENTOUT_PA11 \
	AT32_PIN_MUX('A', 11, MUX_15)
#define EVENTOUT_PA12 \
	AT32_PIN_MUX('A', 12, MUX_15)
#define EVENTOUT_PA13 \
	AT32_PIN_MUX('A', 13, MUX_15)
#define EVENTOUT_PA14 \
	AT32_PIN_MUX('A', 14, MUX_15)
#define EVENTOUT_PA15 \
	AT32_PIN_MUX('A', 15, MUX_15)
#define EVENTOUT_PA2 \
	AT32_PIN_MUX('A', 2, MUX_15)
#define EVENTOUT_PA3 \
	AT32_PIN_MUX('A', 3, MUX_15)
#define EVENTOUT_PA4 \
	AT32_PIN_MUX('A', 4, MUX_15)
#define EVENTOUT_PA5 \
	AT32_PIN_MUX('A', 5, MUX_15)
#define EVENTOUT_PA6 \
	AT32_PIN_MUX('A', 6, MUX_15)
#define EVENTOUT_PA7 \
	AT32_PIN_MUX('A', 7, MUX_15)
#define EVENTOUT_PA8 \
	AT32_PIN_MUX('A', 8, MUX_15)
#define EVENTOUT_PA9 \
	AT32_PIN_MUX('A', 9, MUX_15)
#define EVENTOUT_PB0 \
	AT32_PIN_MUX('B', 0, MUX_15)
#define EVENTOUT_PB1 \
	AT32_PIN_MUX('B', 1, MUX_15)
#define EVENTOUT_PB10 \
	AT32_PIN_MUX('B', 10, MUX_15)
#define EVENTOUT_PB11 \
	AT32_PIN_MUX('B', 11, MUX_15)
#define EVENTOUT_PB12 \
	AT32_PIN_MUX('B', 12, MUX_15)
#define EVENTOUT_PB13 \
	AT32_PIN_MUX('B', 13, MUX_15)
#define EVENTOUT_PB14 \
	AT32_PIN_MUX('B', 14, MUX_15)
#define EVENTOUT_PB15 \
	AT32_PIN_MUX('B', 15, MUX_15)
#define EVENTOUT_PB2 \
	AT32_PIN_MUX('B', 2, MUX_15)
#define EVENTOUT_PB3 \
	AT32_PIN_MUX('B', 3, MUX_15)
#define EVENTOUT_PB4 \
	AT32_PIN_MUX('B', 4, MUX_15)
#define EVENTOUT_PB5 \
	AT32_PIN_MUX('B', 5, MUX_15)
#define EVENTOUT_PB6 \
	AT32_PIN_MUX('B', 6, MUX_15)
#define EVENTOUT_PB7 \
	AT32_PIN_MUX('B', 7, MUX_15)
#define EVENTOUT_PB8 \
	AT32_PIN_MUX('B', 8, MUX_15)
#define EVENTOUT_PB9 \
	AT32_PIN_MUX('B', 9, MUX_15)
#define EVENTOUT_PC13 \
	AT32_PIN_MUX('C', 13, MUX_15)
#define EVENTOUT_PC14 \
	AT32_PIN_MUX('C', 14, MUX_15)
#define EVENTOUT_PC15 \
	AT32_PIN_MUX('C', 15, MUX_15)


/* I2C1_SCL */
#define I2C1_SCL_PA4 \
	AT32_PIN_MUX('A', 4, MUX_4)
#define I2C1_SCL_PA9 \
	AT32_PIN_MUX('A', 9, MUX_8)
#define I2C1_SCL_PB6 \
	AT32_PIN_MUX('B', 6, MUX_4)
#define I2C1_SCL_PB8 \
	AT32_PIN_MUX('B', 8, MUX_4)
#define I2C1_SCL_PC0 \
	AT32_PIN_MUX('C', 0, MUX_7)
#define I2C1_SCL_PC6 \
	AT32_PIN_MUX('C', 0, MUX_4)

/* I2C1_SDA */
#define I2C1_SDA_PA10 \
	AT32_PIN_MUX('A', 10, MUX_8)
#define I2C1_SDA_PB7 \
	AT32_PIN_MUX('B', 7, MUX_4)
#define I2C1_SDA_PB9 \
	AT32_PIN_MUX('B', 9, MUX_4)
#define I2C1_SDA_PC1 \
	AT32_PIN_MUX('C', 1, MUX_7)
#define I2C1_SDA_PC7 \
	AT32_PIN_MUX('C', 7, MUX_4)
#define I2C1_SDA_PC9 \
	AT32_PIN_MUX('C', 9, MUX_8)

/* I2C1_SMBA */
#define I2C1_SMBA_PA1 \
	AT32_PIN_MUX('A', 1, MUX_5)
#define I2C1_SMBA_PA11 \
	AT32_PIN_MUX('A', 11, MUX_6)
#define I2C1_SMBA_PC5 \
	AT32_PIN_MUX('C', 5, MUX_4)

/* I2C2_SCL */
#define I2C2_SCL_PA0 \
	AT32_PIN_MUX('A', 0, MUX_4)
#define I2C2_SCL_PA11 \
	AT32_PIN_MUX('A', 11, MUX_4)
#define I2C2_SCL_PB10 \
	AT32_PIN_MUX('B', 10, MUX_4)
#define I2C2_SCL_PD12 \
	AT32_PIN_MUX('D', 12, MUX_4)
#define I2C2_SCL_PF6 \
	AT32_PIN_MUX('F', 6, MUX_4)

