Maxjta/hal_at32/include/dt-bindings/pinctrl/at32f423v(c)xx-pinctrl.h
/* I2C2_SDA */
#define I2C2_SDA_PA1 \
	AT32_PIN_MUX('A', 1, MUX_4)
#define I2C2_SDA_PA12 \
	AT32_PIN_MUX('A', 12, MUX_4)
#define I2C2_SDA_PB11 \
	AT32_PIN_MUX('B', 11, MUX_4)
#define I2C2_SDA_PB3 \
	AT32_PIN_MUX('B', 3, MUX_4)
#define I2C2_SDA_PB9 \
	AT32_PIN_MUX('B', 9, MUX_7)
#define I2C2_SDA_PC12 \
	AT32_PIN_MUX('C', 12, MUX_4)
#define I2C2_SDA_PD13 \
	AT32_PIN_MUX('D', 13, MUX_4)
#define I2C2_SDA_PF8 \
	AT32_PIN_MUX('F', 8, MUX_4)

/* I2C2_SMBA */
#define I2C2_SMBA_PB12 \
	AT32_PIN_MUX('B', 12, MUX_4)
#define I2C2_SMBA_PD11 \
	AT32_PIN_MUX('D', 11, MUX_4)

/* I2C3_SCL */
#define I2C3_SCL_PA7 \
	AT32_PIN_MUX('A', 7, MUX_4)
#define I2C3_SCL_PA8 \
	AT32_PIN_MUX('A', 8, MUX_4)
#define I2C3_SCL_PB13 \
	AT32_PIN_MUX('B', 13, MUX_7)
#define I2C3_SCL_PB15 \
	AT32_PIN_MUX('B', 15, MUX_4)
#define I2C3_SCL_PC0 \
	AT32_PIN_MUX('C', 0, MUX_4)
#define I2C3_SCL_PD14 \
	AT32_PIN_MUX('D', 14, MUX_4)

/* I2C3_SDA */
#define I2C3_SDA_PB14 \
	AT32_PIN_MUX('B', 14, MUX_4)
#define I2C3_SDA_PB4 \
	AT32_PIN_MUX('B', 4, MUX_4)
#define I2C3_SDA_PC1 \
	AT32_PIN_MUX('C', 1, MUX_4)
#define I2C3_SDA_PC9 \
	AT32_PIN_MUX('C', 9, MUX_4)

/* I2C3_SMBA */
#define I2C3_SMBA_PA9 \
	AT32_PIN_MUX('A', 9, MUX_4)
#define I2C3_SMBA_PB13 \
	AT32_PIN_MUX('B', 13, MUX_4)
#define I2C3_SMBA_PB2 \
	AT32_PIN_MUX('B', 2, MUX_4)
#define I2C3_SMBA_PB5 \
	AT32_PIN_MUX('B', 5, MUX_4)

/* I2S1_CK */
#define I2S1_CK_PA5 \
	AT32_PIN_MUX('A', 5, MUX_5)
#define I2S1_CK_PB3 \
	AT32_PIN_MUX('B', 3, MUX_5)
#define I2S1_CK_PE13 \
	AT32_PIN_MUX('E', 13, MUX_5)

/* I2S1_MCK */
#define I2S1_MCK_PA6 \
	AT32_PIN_MUX('A', 6, MUX_5)
#define I2S1_MCK_PB0 \
	AT32_PIN_MUX('B', 0, MUX_5)
#define I2S1_MCK_PB4 \
	AT32_PIN_MUX('B', 4, MUX_5)
#define I2S1_MCK_PB6 \
	AT32_PIN_MUX('B', 6, MUX_5)
#define I2S1_MCK_PB9 \
	AT32_PIN_MUX('B', 9, MUX_10)
#define I2S1_MCK_PE14 \
	AT32_PIN_MUX('E', 14, MUX_5)

/* I2S1_SDEXT */
#define I2S1_SDEXT_PA7 \
	AT32_PIN_MUX('A', 7, MUX_5)
#define I2S1_SDEXT_PB1 \
	AT32_PIN_MUX('B', 1, MUX_5)
#define I2S1_SDEXT_PB5 \
	AT32_PIN_MUX('B', 5, MUX_5)
#define I2S1_SDEXT_PE15 \
	AT32_PIN_MUX('E', 15, MUX_5)

/* I2S1_WS */
#define I2S1_WS_PA15 \
	AT32_PIN_MUX('A', 15, MUX_5)
#define I2S1_WS_PA4 \
	AT32_PIN_MUX('A', 4, MUX_5)
#define I2S1_WS_PE12 \
	AT32_PIN_MUX('E', 12, MUX_5)

/* I2S2_CK */
#define I2S2_CK_PA9 \
	AT32_PIN_MUX('A', 9, MUX_5)
#define I2S2_CK_PB1 \
	AT32_PIN_MUX('B', 1, MUX_6)
#define I2S2_CK_PB10 \
	AT32_PIN_MUX('B', 10, MUX_5)
#define I2S2_CK_PB13 \
	AT32_PIN_MUX('B', 13, MUX_5)
#define I2S2_CK_PC7 \
	AT32_PIN_MUX('C', 7, MUX_5)
#define I2S2_CK_PD1 \
	AT32_PIN_MUX('D', 1, MUX_6)
#define I2S2_CK_PD3 \
	AT32_PIN_MUX('D', 3, MUX_5)
#define I2S2_CK_PF2 \
	AT32_PIN_MUX('F', 2, MUX_5)

/* I2S2_MCK */
#define I2S2_MCK_PA3 \
	AT32_PIN_MUX('A', 3, MUX_5)
#define I2S2_MCK_PA6 \
	AT32_PIN_MUX('A', 6, MUX_6)
#define I2S2_MCK_PA12 \
	AT32_PIN_MUX('A', 12, MUX_5)
#define I2S2_MCK_PB14 \
	AT32_PIN_MUX('B', 14, MUX_5)
#define I2S2_MCK_PC2 \
	AT32_PIN_MUX('C', 2, MUX_5)
#define I2S2_MCK_PC6 \
	AT32_PIN_MUX('C', 6, MUX_5)
#define I2S2_MCK_PD3 \
	AT32_PIN_MUX('D', 3, MUX_5)

/* I2S2_SDEXT */
#define I2S2_SDEXT_PA10 \
	AT32_PIN_MUX('A', 10, MUX_5)
#define I2S2_SDEXT_PC1 \
	AT32_PIN_MUX('C', 1, MUX_6)
#define I2S2_SDEXT_PB14 \
	AT32_PIN_MUX('B', 14, MUX_6)
#define I2S2_SDEXT_PB15 \
	AT32_PIN_MUX('B', 15, MUX_5)
#define I2S2_SDEXT_PC3 \
	AT32_PIN_MUX('C', 3, MUX_5)
#define I2S2_SDEXT_PD4 \
	AT32_PIN_MUX('D', 4, MUX_6)

/* I2S2_WS */
#define I2S2_WS_PA11 \
	AT32_PIN_MUX('A', 11, MUX_5)
#define I2S2_WS_PB12 \
	AT32_PIN_MUX('B', 12, MUX_5)
#define I2S2_WS_PB9 \
	AT32_PIN_MUX('B', 9, MUX_5)
#define I2S2_WS_PD0 \
	AT32_PIN_MUX('D', 0, MUX_7)
#define I2S2_WS_PD1 \
	AT32_PIN_MUX('D', 1, MUX_7)
#define I2S2_WS_PF1 \
	AT32_PIN_MUX('F', 1, MUX_5)

/* I2S3_CK */
#define I2S3_CK_PB12 \
	AT32_PIN_MUX('B', 12, MUX_7)
#define I2S3_CK_PB3 \
	AT32_PIN_MUX('B', 3, MUX_6)
#define I2S3_CK_PB7 \
	AT32_PIN_MUX('B', 7, MUX_6)
#define I2S3_CK_PC10 \
	AT32_PIN_MUX('C', 10, MUX_6)

/* I2S3_MCK */
#define I2S3_MCK_PB4 \
	AT32_PIN_MUX('B', 4, MUX_6)
#define I2S3_MCK_PB8 \
	AT32_PIN_MUX('B', 8, MUX_6)
#define I2S3_MCK_PB10 \
	AT32_PIN_MUX('B', 10, MUX_6)
#define I2S3_MCK_PC7 \
	AT32_PIN_MUX('C', 7, MUX_6)
#define I2S3_MCK_PC11 \
	AT32_PIN_MUX('C', 11, MUX_6)

/* I2S3_SDEXT */
#define I2S3_SDEXT_PA14 \
	AT32_PIN_MUX('A', 14, MUX_6)
#define I2S3_SDEXT_PB0 \
	AT32_PIN_MUX('B', 0, MUX_6)
#define I2S3_SDEXT_PB2 \
	AT32_PIN_MUX('B', 2, MUX_6)
#define I2S3_SDEXT_PB5 \
	AT32_PIN_MUX('B', 5, MUX_6)
#define I2S3_SDEXT_PB9 \
	AT32_PIN_MUX('B', 9, MUX_6)
#define I2S3_SDEXT_PC1 \
	AT32_PIN_MUX('C', 1, MUX_5)
#define I2S3_SDEXT_PC12 \
	AT32_PIN_MUX('C', 12, MUX_5)
#define I2S3_SDEXT_PD0 \
	AT32_PIN_MUX('D', 0, MUX_5)
#define I2S3_SDEXT_PD6 \
	AT32_PIN_MUX('D', 6, MUX_5)

/* I2S3_WS */
#define I2S3_WS_PA15 \
	AT32_PIN_MUX('A', 15, MUX_6)
#define I2S3_WS_PA4 \
	AT32_PIN_MUX('A', 4, MUX_6)
#define I2S3_WS_PA1 \
	AT32_PIN_MUX('A', 1, MUX_6)
#define I2S3_WS_PB6 \
	AT32_PIN_MUX('B', 6, MUX_6)

/* IR_OUT */
#define IR_OUT_PA13 \
	AT32_PIN_MUX('A', 13, MUX_1)
#define IR_OUT_PB9 \
	AT32_PIN_MUX('B', 9, MUX_0)

/* JNTRST */
#define JNTRST_PB4 \
	AT32_PIN_MUX('B', 4, MUX_0)

/* JTCK */
#define JTCK_PA14 \
	AT32_PIN_MUX('A', 14, MUX_0)

/* JTDI */
#define JTDI_PA15 \
	AT32_PIN_MUX('A', 15, MUX_0)

/* JTDO */
#define JTDO_PB3 \
	AT32_PIN_MUX('B', 3, MUX_0)

/* JTMS */
#define JTMS_PA13 \
	AT32_PIN_MUX('A', 13, MUX_0)

/* OTG1_D+ */
#define OTG1_DP_PA12 \
	AT32_PIN_MUX('A', 12, MUX_10)

/* OTG1_D- */
#define OTG1_DM_PA11 \
	AT32_PIN_MUX('A', 11, MUX_10)

/* OTG1_ID */
#define OTG1_ID_PA10 \
	AT32_PIN_MUX('A', 10, MUX_10)

/* OTG1_OE */
#define OTG1_OE_PA13 \
	AT32_PIN_MUX('A', 13, MUX_10)

/* OTG1_SOF */
#define OTG1_SOF_PA8 \
	AT32_PIN_MUX('A', 8, MUX_10)

/* OTG1_VBUS */
#define OTG1_VBUS_PA9 \
	AT32_PIN_MUX('A', 9, MUX_10)

/* SPI1_CS */
#define SPI1_CS_PA15 \
	AT32_PIN_MUX('A', 15, MUX_5)
#define SPI1_CS_PA4 \
	AT32_PIN_MUX('A', 4, MUX_5)
#define SPI1_CS_PE12 \
	AT32_PIN_MUX('E', 12, MUX_5)

/* SPI1_MISO */
#define SPI1_MISO_PA6 \
	AT32_PIN_MUX('A', 6, MUX_5)
#define SPI1_MISO_PB0 \
	AT32_PIN_MUX('B', 0, MUX_5)
#define SPI1_MISO_PB4 \
	AT32_PIN_MUX('B', 4, MUX_5)
#define SPI1_MISO_PE14 \
	AT32_PIN_MUX('E', 14, MUX_5)

/* SPI1_MOSI */
#define SPI1_MOSI_PA7 \
	AT32_PIN_MUX('A', 7, MUX_5)
#define SPI1_MOSI_PB1 \
	AT32_PIN_MUX('B', 1, MUX_5)
#define SPI1_MOSI_PB5 \
	AT32_PIN_MUX('B', 5, MUX_5)
#define SPI1_MOSI_PE15 \
	AT32_PIN_MUX('E', 15, MUX_5)

/* SPI1_SCK */
#define SPI1_SCK_PA5 \
	AT32_PIN_MUX('A', 5, MUX_5)
#define SPI1_SCK_PB3 \
	AT32_PIN_MUX('B', 3, MUX_5)
#define SPI1_SCK_PE13 \
	AT32_PIN_MUX('E', 13, MUX_5)

/* SPI2_CS */
#define SPI2_CS_PA11 \
	AT32_PIN_MUX('A', 11, MUX_5)
#define SPI2_CS_PB12 \
	AT32_PIN_MUX('B', 12, MUX_5)
#define SPI2_CS_PB9 \
	AT32_PIN_MUX('B', 9, MUX_5)
#define SPI2_CS_PD0 \
	AT32_PIN_MUX('D', 0, MUX_7)
#define SPI2_CS_PD1 \
	AT32_PIN_MUX('D', 1, MUX_7)
#define SPI2_CS_PF1 \
	AT32_PIN_MUX('F', 1, MUX_5)

/* SPI2_MISO */
#define SPI2_MISO_PA12 \
	AT32_PIN_MUX('A', 12, MUX_5)
#define SPI2_MISO_PB14 \
	AT32_PIN_MUX('B', 14, MUX_5)
#define SPI2_MISO_PC2 \
	AT32_PIN_MUX('C', 2, MUX_5)
#define SPI2_MISO_PD3 \
	AT32_PIN_MUX('D', 3, MUX_6)

/* SPI2_MOSI */
#define SPI2_MOSI_PA10 \
	AT32_PIN_MUX('A', 10, MUX_5)
#define SPI2_MOSI_PB15 \
	AT32_PIN_MUX('B', 15, MUX_5)
#define SPI2_MOSI_PC1 \
	AT32_PIN_MUX('C', 1, MUX_5)
#define SPI2_MOSI_PC3 \
	AT32_PIN_MUX('C', 3, MUX_5)
#define SPI2_MOSI_PD4 \
	AT32_PIN_MUX('D', 4, MUX_6)

